In [1]:
import numpy  as np
import pandas as pd

In [56]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
'Math Score': [85, 92, 78, 88],
'English Score': [90, 86, 92, 80]}

df = pd.DataFrame(data)

In [57]:
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          92             86
2  Charlie          78             92
3    David          88             80

### 1. Retrieve the English score of 'Charlie'.

In [21]:
df.loc[df['Name'] == 'Charlie',"English Score"].values[0]

92

### 2. Get the Math scores of all students.

In [23]:
print(df.loc[:,"Math Score"].values)

[85 92 78 88]

### 3. Access the English score of the first student.

In [27]:
print(df.iloc[0]['English Score'])

90

### 4. Retrieve the Math score of the last student.

In [32]:
df.iloc[-1]["Math Score"]

88

### 5. Update Bob's Math score to 95.

In [40]:
df.loc[df['Name'] == "Bob","Math Score"] = 95
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             86
2  Charlie          78             92
3    David          88             80

### 6. Increase Charlie's English score by 5 points.

In [43]:
df.loc[df['Name']== "Charlie","English Score"] +=5
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             86
2  Charlie          78             97
3    David          88             80

### 7. Add a new row for 'Eve' with Math Score 88 and English Score 95.

In [47]:
df.loc[len(df)] = ["Eve",88,95]
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             86
2  Charlie          78             97
3    David          88             80
4      Eve          88             95

### 8. Delete the row for 'David' from the DataFrame.

In [59]:
del_index = df.loc[df['Name'] == 'David'].index.values[0]
df_new = df.drop(labels = del_index)
df_new

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          92             86
2  Charlie          78             92

### 9. Insert a new column called 'Science Score' with values [92, 84, 89, 78].

In [62]:
df['Science Score'] = [92,84,89,78]
df

      Name  Math Score  English Score  Science Score
0    Alice          85             90             92
1      Bob          92             86             84
2  Charlie          78             92             89
3    David          88             80             78

### 10 . Delete the 'English Score' column from the DataFrame.

In [63]:
df_new = df.drop("English Score",axis=1)
df_new

      Name  Math Score  Science Score
0    Alice          85             92
1      Bob          92             84
2  Charlie          78             89
3    David          88             78

### 11. Create a new column 'Total Score' that represents the sum of Math Score and English Score for each student.

In [64]:
df['Total Score'] = df['Math Score'] + df['English Score']

In [65]:
df

      Name  Math Score  English Score  Science Score  Total Score
0    Alice          85             90             92          175
1      Bob          92             86             84          178
2  Charlie          78             92             89          170
3    David          88             80             78          168

### 12. Find the student with the highest Total Score.

In [70]:
student_with_highest_score = df.loc[df['Total Score'].idxmax(),"Name"]
print("Student with the highest Total Score:", student_with_highest_score)

Student with the highest Total Score: Bob

In [71]:
data2 = {'Name': ['Eve', 'Frank'],
'Math Score': [87, 76],
'English Score': [94, 82]}
df2 = pd.DataFrame(data2)

In [72]:
df2

    Name  Math Score  English Score
0    Eve          87             94
1  Frank          76             82

In [74]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
'Math Score': [85, 92, 78, 88],
'English Score': [90, 86, 92, 80]}

df = pd.DataFrame(data)

In [75]:
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          92             86
2  Charlie          78             92
3    David          88             80

In [80]:
df_final = pd.concat([df,df2],ignore_index=True)

In [81]:
df_final

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          92             86
2  Charlie          78             92
3    David          88             80
4      Eve          87             94
5    Frank          76             82